app/controllers/ratings_controller.rb

SELECT "ratings".* FROM "ratings"
---
  def index
    @ratings = Rating.all

INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 12], ["beer_id", 1], ["created_at", "2016-02-25 13:45:31.764964"], ["updated_at", "2016-02-25 13:45:31.764964"]]
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)
    if @rating.save